# Tech Workers in Tech Companies

In [1]:
import pandas as pd
import numpy as np
import sqlite3
import seaborn as sns
import matplotlib as mpl
import matplotlib.pyplot as plt
import warnings
import datetime
import matplotlib.dates as mdates

from scipy import stats
from matplotlib.dates import DateFormatter
from IPython.display import display

# Load and Display Raw Data

In [2]:
db_survey = sqlite3.connect(
    "C:\\Users\\Space\\Documents\\py\\Projects\\TuringCollege\\TechMentalHealth\\DataSet\\mental_health.sqlite"
)

In [3]:
%matplotlib inline
pd.options.display.max_rows = 300000
pd.options.display.max_columns = 999
pd.options.display.max_colwidth = 500

# Answers

In [4]:
df_answers = pd.read_sql_query("SELECT * FROM Answer", db_survey)
df_answers.head()

  AnswerText  SurveyID  UserID  QuestionID
0         37      2014       1           1
1         44      2014       2           1
2         32      2014       3           1
3         31      2014       4           1
4         31      2014       5           1

# Tech Workers in Tech Companies

In [37]:
df_Answer9 = pd.read_sql_query(
    "SELECT USERID FROM Answer where QuestionID = 9 AND AnswerText = '1'",
    db_survey
)
df_Answer9.head()

   UserID
0       1
1       3
2       4
3       5
4       6

In [38]:
df_Answer9.count()

UserID    2888
dtype: int64

In [40]:
df_Answer13 = pd.read_sql_query(
    "SELECT USERID FROM Answer where QuestionID = 13 AND AnswerText = '1'",
    db_survey
)
df_Answer13.head()

   UserID
0    1265
1    1269
2    1272
3    1274
4    1280

In [41]:
df_Answer13.count()

UserID    1471
dtype: int64

In [42]:
df_TechinTech = pd.merge(df_Answer13, df_Answer9 , on='UserID', how='inner')
df_TechinTech.count()

UserID    909
dtype: int64

In [34]:
df_TechinTech.head()

   UserID
0    2694
1    2695
2    2696
3    2697
4    2700